CSI API ETABS v1
cPropMaterial.SetDamping Method
 Sets the additional material damping data for the material.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetDamping(
	string Name,
	double ModalRatio,
	double ViscousMassCoeff,
	double ViscousStiffCoeff,
	double HystereticMassCoeff,
	double HystereticStiffCoeff,
	double Temp = 0
)
Function SetDamping (
	Name As String,
	ModalRatio As Double,
	ViscousMassCoeff As Double,
	ViscousStiffCoeff As Double,
	HystereticMassCoeff As Double,
	HystereticStiffCoeff As Double,
	Optional Temp As Double = 0
) As Integer
Dim instance As cPropMaterial
Dim Name As String
Dim ModalRatio As Double
Dim ViscousMassCoeff As Double
Dim ViscousStiffCoeff As Double
Dim HystereticMassCoeff As Double
Dim HystereticStiffCoeff As Double
Dim Temp As Double
Dim returnValue As Integer
returnValue = instance.SetDamping(Name,
	ModalRatio, ViscousMassCoeff, ViscousStiffCoeff,
	HystereticMassCoeff, HystereticStiffCoeff,
	Temp)
int SetDamping(
	String^ Name,
	double ModalRatio,
	double ViscousMassCoeff,
	double ViscousStiffCoeff,
	double HystereticMassCoeff,
	double HystereticStiffCoeff,
	double Temp = 0
)
abstract SetDamping :
        Name : string *
        ModalRatio : float *
        ViscousMassCoeff : float *
        ViscousStiffCoeff : float *
        HystereticMassCoeff : float *
        HystereticStiffCoeff : float *
        ?Temp : float
(* Defaults:
        let _Temp = defaultArg Temp 0
*)
-> int
Parameters
Name
Type: System.String
The name of an existing material property.
ModalRatio
Type: System.Double
The modal damping ratio.
ViscousMassCoeff
Type: System.Double
The mass coefficient for viscous proportional damping.
ViscousStiffCoeff
Type: System.Double
The stiffness coefficient for viscous proportional damping.
HystereticMassCoeff
Type: System.Double
The mass coefficient for hysteretic proportional damping.
HystereticStiffCoeff
Type: System.Double
The stiffness coefficient for hysteretic proportional damping.
Temp (Optional)
Type: System.Double
The temperature at which the specified data applies. The temperature must have been previously defined for the material.
This item applies only if the specified material has properties that are temperature dependent. That is, it applies only if properties are specified for the material at more than one temperature.
Return Value
Type: Int32
Returns zero if the data is successfully assigned; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
       Dim SapModel As cSapModel
       Dim EtabsObject As cOAPI
       Dim ret As Integer = -1
   'create ETABS object
       Dim myHelper as cHelper = New Helper
       EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
   'start ETABS application
       ret = EtabsObject.ApplicationStart()
   'create SapModel object
       SapModel = EtabsObject.SapModel
   'initialize model
       ret = SapModel.InitializeNewModel()
   'create steel deck template model
       ret = SapModel.File.NewSteelDeck(4,12,12,4,4,24,24)
   'assign material damping data
     ret = SapModel.PropMaterial.SetDamping("4000Psi", 0.04, 0, 0, 0, 0)
   'close ETABS
       EtabsObject.ApplicationExit(False)
   'clean up variables
       SapModel = Nothing
       EtabsObject = Nothing
   End Sub
See Also
Reference
cPropMaterial Interface
ETABSv1 Namespace